#==============================================================================
# ■ 输入处理脚本
#------------------------------------------------------------------------------
#
#   继承父类: M5Script::M5Handler::Handler
#
#   方法：press_sym、trigger_sym、repeat_sym
#
#   使用脚本请署名，用于营利为目的的游戏请事先与我联系
#
#==============================================================================

#--------------------------------------------------------------------------
# ● 命名空间
#--------------------------------------------------------------------------
module M5Script; module M5Handler
#--------------------------------------------------------------------------
# ● 处理玩家输入的类
#--------------------------------------------------------------------------
class Handler
  #--------------------------------------------------------------------------
  # ● 初始化
  #--------------------------------------------------------------------------
  def initialize(object = nil)
    @object = object
  end
  #--------------------------------------------------------------------------
  # ● 输入列表
  #--------------------------------------------------------------------------
  def self.input_list
    [:A, :B, :C, :X, :Y, :Z, :L, :R, :DOWN, :LEFT, :RIGHT, :UP,
      :SHIFT, :CTRL, :ALT, :F5, :F6, :F7, :F8, :F9]
  end
  #--------------------------------------------------------------------------
  # ● 定义方法
  #--------------------------------------------------------------------------
  input_list.each do |sym|
    method_name = sym.to_s.downcase
    define_method "press_#{method_name}" do end
    define_method "trigger_#{method_name}" do end
    define_method "repeat_#{method_name}" do end
  end
  #--------------------------------------------------------------------------
  # ● 更新玩家的输入
  #--------------------------------------------------------------------------
  def update
    self.class.input_list.each do |sym|
      next unless Input.press?(sym)
      method_name = sym.to_s.downcase
      send("press_#{method_name}")
      send("trigger_#{method_name}") if Input.trigger?(sym)
      send("repeat_#{method_name}") if Input.repeat?(sym)
    end
  end
end
end;end #module M5Script; module M5Handler